<center><h1><b><font size="6">Pandas DataFrames: A Revision to pandas DataFrames</font></b></h1></center>

#### A revision to pandas DataFrames

#### Import Libraries

In [1]:
import pandas as pd
import numpy as np

#### Create an Array

In [2]:
array_a = np.array([[3, 2, 1], [6, 3, 2]])
array_a

array([[3, 2, 1],
       [6, 3, 2]])

In [6]:
array_a.dtype

dtype('int32')

#### check if 1D or 2D arrays?

In [8]:
# Verificar si es 1D o 2D
if array_a.ndim == 1:
    print("unidimensional (1D)")
elif array_a.ndim == 2:
    print("bidimensional (2D)")
else:
    print("more than 2 dimensions")

bidimensional (2D)

#### created array_a saved as pandas DF

In [9]:
pd.DataFrame(array_a)

   0  1  2
0  3  2  1
1  6  3  2

In [10]:
type(pd.DataFrame(array_a))

pandas.core.frame.DataFrame

#### given a columns

In [11]:
df = pd.DataFrame(array_a, columns = ['Column 1', 'Column 2', 'column 3'])
df

   Column 1  Column 2  column 3
0         3         2         1
1         6         3         2

In [12]:
df = pd.DataFrame(array_a, columns = ['Column 1', 'Column 2', 'column 3'], index = ['Row 1', 'Row 2'])
df

       Column 1  Column 2  column 3
Row 1         3         2         1
Row 2         6         3         2

#### Load the data

In [14]:
data = pd.read_csv('./data/Lending-company.csv', index_col = 'LoanID')
lending_co_data = data.copy()
lending_co_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [15]:
type(lending_co_data)

pandas.core.frame.DataFrame